public/programming/notes/usb-for-apocalypse.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="/simple.css" />
<link rel="stylesheet" href="/giovanni-diary/simple.css" />
<meta property="og:title" content="Giovanni's Diary">
<meta property="og:description" content="Diary of Giovanni's adventures.">
<meta property="og:image" content="https://giovanni-diary.netlify.app/logo.png">
<meta property="og:url" content="https://giovanni-diary.netlify.app/">
</head>
<body>
<div id="content" class="content">
<p>
<a href="../../index.html">Giovanni's Diary</a> &gt; <a href="../../subjects.html">Subjects</a> &gt; <a href="../programming.html">Programming</a> &gt; <a href="notes.html">Notes</a> &gt;
</p>

<div id="outline-container-org94c31d8" class="outline-2">
<h2 id="org94c31d8">USB for the apocalypse</h2>
<div class="outline-text-2" id="text-org94c31d8">
<p>
I am preparing an USB stick in case I need to spend a long period of
time offline, with everything I would need to continue to do my usual
stuff. I will set the maximum size to 64GB.
</p>

<p>
I will need some sort of operating system, and one that I have full
control of and would last forever. For this reasons, something like
debian would be great.
</p>

<p>
The USB will have two partitions: a bootable one with the linux
distribution and a data one. The data will have the following content:
</p>
<ul class="org-ul">
<li>Music: A local music directory</li>
<li>Offline Encyclopedia: download wikipedia sections, right know I have
computer science, math and history.</li>
<li>Offline documentation for SDL3, opengl, cairo.</li>
<li>source code: source of the linux kernel, various desktop utilities
such as a window manager (dwm), SDL3, cairo.</li>
<li>compiler for C code (gcc).</li>
<li>Text Editor (emacs).</li>
<li>Multimedia libraries: ffmpeg and vlc, libpng</li>
<li>Other libraries: opengl</li>
<li>Offline rfc browser (rfc-mode)</li>
</ul>

<hr />

<p>
Travel: <a href="offline-programming.html">Offline programming</a>, <a href="../../theindex.html">Index</a>
</p>
</div>
</div>
</div>
</body>
</html>
